{
    "headerTitle": "Mis Tareas ✔️",
    "dashboardPending": "Pendientes",
    "dashboardCompleted": "Completadas",
    "formInputPlaceholder": "Añadir tarea para el día seleccionado...",
    "formButton": "Añadir",
    "filterAll": "Todas",
    "filterPriority": "Prioridades",
    "filterCompleted": "Completadas",
    "searchInputPlaceholder": "Buscar en este día...",
    "sortCreation": "Por Creación",
    "sortPriority": "Por Prioridad",
    "sortAlphabetical": "Alfabéticamente (A-Z)",
    "sortStatus": "Por Estado",
    "settingsTitle": "Configuración",
    "settingsAppearance": "Apariencia",
    "settingsTheme": "Tema",
    "settingsLanguage": "Idioma",
    "settingsAccentColor": "Color de Acento",
    "helpTitle": "Manual de Usuario",
    "aboutTitle": "Acerca de la Aplicación",
    "exportTitle": "Exportar y Compartir",
    "exportDownloadTitle": "Descargar Lista Actual",
    "exportDownloadSubtitle": "Se exportarán las tareas visibles para el día seleccionado.",
    "exportShareTitle": "Compartir Lista",
    "exportShareNative": "Compartir...",
    "exportShareCopy": "Copiar",
    "dueDateTitle": "Establecer Fecha de Vencimiento",
    "dueDateRemove": "Quitar Fecha",
    "save": "Guardar",
    "priorityTitle": "Asignar Prioridad",
    "priorityUrgent": "Urgente",
    "priorityImportant": "Importante",
    "priorityNormal": "Normal",
    "binTitle": "Papelera de Reciclaje",
    "binEmpty": "Vaciar Papelera",
    "propertiesTitle": "Propiedades de la Papelera",
    "propertiesItems": "Elementos:",
    "propertiesOldest": "Elemento más antiguo:",
    "propertiesNewest": "Elemento más reciente:",
    "cancel": "Cancelar",
    "confirm": "Confirmar",
    "binRestoreAll": "Restaurar Todo",
    "properties": "Propiedades",
    "taskDeletedConfirmation": "¿Estás seguro de que quieres eliminar esta tarea?",
    "emptyBinConfirmation": "¿Eliminar permanentemente todos los elementos?",
    "restoreAllConfirmation": "¿Restaurar todos los elementos de la papelera?",
    "footerPrivacy": "Política de Privacidad",
    "footerAbout": "Sobre Mí",
    "footerContact": "Contacto",
    "pageTitlePrivacy": "Política de Privacidad",
    "pageTitleAbout": "Sobre Mí",
    "pageTitleContact": "Contacto",
    "backToApp": "← Volver a la Aplicación",
    "helpContent": "<h3>¡Bienvenido a tu Planificador de Tareas!</h3><p>Aquí tienes una guía rápida para sacar el máximo provecho de la aplicación.</p><h3>1. Navegación Principal: El Planificador</h3><p>La vista principal es un planificador semanal. Usa los botones <strong>&lt;</strong> y <strong>&gt;</strong> para navegar entre semanas. Haz clic en el número de un día para seleccionarlo y ver las tareas asociadas a esa fecha. El día actual siempre tendrá un borde de color para que lo identifiques fácilmente.</p><h3>2. Creación y Gestión de Tareas</h3><ul><li><strong>Añadir Tarea:</strong> Escribe en el campo de texto y pulsa \"Añadir\". La tarea se creará automáticamente en el día que tengas seleccionado.</li><li><strong>Marcar como Completada:</strong> Usa la casilla de verificación a la izquierda de cada tarea.</li><li><strong>Asignar Prioridad (🏷️):</strong> Clasifica tus tareas como \"Urgente\", \"Importante\" o \"Normal\". Esto añadirá un borde de color distintivo para una mejor organización visual.</li><li><strong>Cambiar Fecha (📅):</strong> ¿Necesitas mover una tarea a otro día? Usa este botón. La tarea desaparecerá de la vista actual y se moverá al día que elijas en el calendario.</li><li><strong>Editar (✏️) y Eliminar (🗑️):</strong> Modifica el texto de una tarea o muévela a la papelera.</li></ul><h3>3. Organización y Búsqueda</h3><p>Recuerda que los filtros, la búsqueda y el ordenamiento se aplican <strong>únicamente a las tareas del día que estás viendo</strong>.</p><ul><li><strong>Filtros:</strong> Usa los botones \"Todas\", \"Prioridades\" y \"Completadas\" para visualizar solo lo que necesitas.</li><li><strong>Búsqueda:</strong> El campo de búsqueda te permite encontrar tareas por su nombre rápidamente.</li><li><strong>Ordenar:</strong> El menú desplegable te permite reordenar la lista por prioridad, orden alfabético o estado (pendientes primero).</li></ul><h3>4. Funciones Adicionales</h3><ul><li><strong>Papelera (🗑️):</strong> El icono en la cabecera abre la papelera. Desde allí puedes restaurar tareas individuales o vaciarla. Haz <strong>clic derecho</strong> en el icono para ver opciones rápidas como \"Restaurar Todo\".</li><li><strong>Configuración (⚙️):</strong> Cambia el tema (claro/oscuro), el idioma y el color de acento de la aplicación para que se adapte a tu estilo.</li><li><strong>Exportar y Compartir (↑):</strong> Descarga tu lista de tareas del día en formato PDF, TXT o compártela directamente en otras apps.</li></ul>",
    "aboutContent": "<p>Soy Juan Daniel Pedraza Díaz, un desarrollador apasionado por crear herramientas simples y efectivas que ayuden a las personas a ser más productivas en su día a día.</p><h3>Mi Misión</h3><p>Creo que la organización no debería ser complicada. Mi misión es proporcionar una aplicación de lista de tareas intuitiva, rápida y personalizable que funcione perfectamente en cualquier dispositivo, sin necesidad de registros ni de compartir datos personales.</p>",
    "contactContent": "<p>¡Me encantaría saber de usted! Si tiene preguntas, sugerencias o simplemente quiere saludar, puede contactarme a través del siguiente correo electrónico:</p><p><strong>Correo Electrónico:</strong> <a href=\"mailto:jdpedraza930722@gmail.com\">jdpedraza930722@gmail.com</a></p><p>Hago mi mejor esfuerzo por responder a todos los mensajes en un plazo de 48 horas.</p>",
    "privacyContent": "<p><strong>Última actualización: 28 de Agosto de 2025</strong></p><p>Su privacidad es importante para nosotros. Esta política de privacidad explica qué datos personales recopilamos y cómo los usamos.</p><h3>Datos que Recopilamos</h3><p>Esta aplicación es una herramienta que funciona enteramente en su navegador. Para asegurar que sus tareas se guarden entre sesiones, utilizamos la tecnología <strong>localStorage</strong> del navegador.</p><ul><li><strong>LocalStorage:</strong> Todos los datos que usted introduce (tareas, configuraciones de idioma, tema y color) se almacenan exclusivamente en su propio dispositivo, dentro del almacenamiento local de su navegador.</li><li><strong>No Recopilación de Datos Personales:</strong> No recopilamos, transmitimos ni almacenamos ninguna información personal identificable en nuestros servidores. No tenemos acceso a sus tareas ni a ninguna otra información que introduzca.</li></ul><h3>Uso de Cookies y Anuncios de Terceros</h3><p>Este sitio web utiliza Google AdSense para mostrar anuncios. Google AdSense puede utilizar cookies para mostrar anuncios relevantes basados en sus visitas anteriores a este u otros sitios web. Puede optar por no participar en la publicidad personalizada visitando la página de <a href=\"https://www.google.com/settings/ads\" target=\"_blank\" rel=\"noopener noreferrer\">Configuración de anuncios de Google</a>.</p><h3>Contacto</h3><p>Si tiene alguna pregunta sobre esta Política de Privacidad, por favor contáctenos a través de nuestra página de contacto.</p>"
}
